EDT/УТ/src/InformationRegisters/ДокументыЗакрытыеДляИзменения/ДокументыЗакрытыеДляИзменения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыЗакрытыеДляИзменения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗакрытДляРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ПривязкаМашинКРейсам/ПривязкаМашинКРейсам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПривязкаМашинКРейсам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>ОтвязанВодитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтвязанЭкспедитор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КтоПривязал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяПривязка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыТранспорта/ДополнительныеПараметрыТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыТранспорта</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>УдаленноеЗакрытиеРейсов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РежимПечатиЧеков</name>
    <type>
      <types>EnumRef.ВариантыПечатиЧековРМЭкипажа</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновнаяРольТранспорта</name>
    <type>
      <types>CatalogRef.РолиТранспорта</types>
    </type>
  </resources>
  <resources>
    <name>КассовыйСервер</name>
    <type>
      <types>ExchangePlanRef.ОбменСКассовымСервером</types>
    </type>
  </resources>
  <resources>
    <name>ФорматАвтотранспорта</name>
    <type>
      <types>CatalogRef.ФорматыАвтотранспорта</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоШтатныйТранспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/РежимыНазначенияНомеровПалет/РежимыНазначенияНомеровПалет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыНазначенияНомеровПалет</name>
  <enumValues>
    <name>Случайно</name>
  </enumValues>
  <enumValues>
    <name>ПоВремениОкончанияРейса</name>
  </enumValues>
  <enumValues>
    <name>ПоМаркеТранспортаИПоВремениОкончанияРейса</name>
  </enumValues>
  <enumValues>
    <name>ПоМаркеТранспортаИПоВремениОкончанияРейсаПлюсПрефикс</name>
  </enumValues>
  <enumValues>
    <name>ПоМаркеТранспортаИНомеруПолигона</name>
  </enumValues>
  <enumValues>
    <name>ПоПрефиксуСмены</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/Рейс/Рейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рейс</name>
  <registerRecords>InformationRegister.РейсыЗаказов</registerRecords>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТипыТранспортовВероут</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПалетты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗагрузкиДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РейсМестнойДоставки</name>
    <type>
      <types>BusinessProcessRef.новаРейсМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>axi_Загрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленноеЗакрытиеРейса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>vr_РаспределительныйЦентр</name>
    <type>
      <types>CatalogRef.РаспределительныеЦентрыVeeroute</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодикаМаршрутизации</name>
    <type>
      <types>EnumRef.МетодикаЛогистическойМаршрутизации</types>
    </type>
  </attributes>
  <attributes>
    <name>РольРейса</name>
    <type>
      <types>CatalogRef.РолиТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаРейса</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДоставок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаборов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Точки</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасположения</name>
      <type>
        <types>EnumRef.ТипыРасположенияТочки</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТочки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресТочки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Широта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяПрибытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяВремяОтправления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановоеРасстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическийПробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДвиженияПоПлану</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДвиженияФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапланированнаяДлительностьОстановки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяДлительностьОстановки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетноеВремяПрибытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетноеВремяУбытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказа</name>
      <type>
        <types>CatalogRef.СтатусыЗаказовВероут</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗаказа</name>
      <type>
        <types>EnumRef.ВидыЗаказовВероут</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаборТовара</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДобавленВРучную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдаленИзРейса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагруженИзВероут</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальнаяМаршрутизация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДобавленВЗапланированныйРейс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поездки</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоездки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяДистанция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяПродолжительностьПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяНачалаПоездки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяОкончанияПоездки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаДоступностиВодителя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончанияДоступностиВодителя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/CommonModules/baoВызовСервера/Module.bsl
//+++ БАО 22.05.2017 №874 
Функция ПолучитьМассивДоговорников() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Код = &КодDirectCredit
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Код = &КодPoscredit
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Родитель.ОсновнойМагазин.Код = &КодPoscredit
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Родитель.ОсновнойМагазин.Код = &КодDirectCredit
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Родитель.Родитель.ОсновнойМагазин.Код = &КодPoscredit
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Родитель.Родитель.ОсновнойМагазин.Код = &КодDirectCredit";
	
	
	Запрос.УстановитьПараметр("КодPoscredit","Shop_604 ");
	Запрос.УстановитьПараметр("КодDirectCredit","Shop_234");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции
//--- БАО 22.05.2017 №874 

//+++ БАО 23.05.2017 №876
Функция ВернутьСтавкуНДСПоКодуАдминки(КодНДСАдминки) Экспорт 
	
	//+++ БАО 24.05.2017 №876
	
	//Если КодНДСАдминки = 0 Тогда
	//	Возврат Справочники.СтавкиНДСФЗ54.НДС0;
	//ИначеЕсли КодНДСАдминки = 10 Тогда
	//	Возврат Справочники.СтавкиНДСФЗ54.НДС10;
	//ИначеЕсли КодНДСАдминки = 18 Тогда
	//	Возврат Справочники.СтавкиНДСФЗ54.НДС18;
	//ИначеЕсли КодНДСАдминки = 20 Тогда
	//	Возврат Справочники.СтавкиНДСФЗ54.НДС20;
	//ИначеЕсли КодНДСАдминки = -1 Тогда
	//	Возврат Справочники.СтавкиНДСФЗ54.БезНДС;
	//Иначе //-2
	//	Возврат Справочники.СтавкиНДСФЗ54.ПустаяСсылка();
	//КонецЕсли;
	
	НайденныйЭлемент = Справочники.СтавкиНДСФЗ54.НайтиПоРеквизиту("КодВАдминке",  КодНДСАдминки);
	Возврат НайденныйЭлемент;
	
	//--- БАО 24.05.2017 №876
	
КонецФункции	
//--- БАО 23.05.2017 №876

//+++ БАО 08.06.2017 №1024 
Функция ДобавитьЗаписьВРегистрДокументыЗакрытыеДляИзменения(Документ, ЗакрытДляРедактирования, ИнициаторБлокировки = Неопределено) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ДокументыЗакрытыеДляИзменения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.ЗакрытДляРедактирования = ЗакрытДляРедактирования;
	//+Степанов Задача № 3439
	Если ИнициаторБлокировки <> Неопределено Тогда
		МенеджерЗаписи.ДокументРегистратор = ИнициаторБлокировки;		
	Иначе	
		МенеджерЗаписи.ДокументРегистратор = Документ;
	КонецЕсли;
	//-Степанов
	МенеджерЗаписи.Записать();
	
КонецФункции

Функция РейсЗакрыт(Документ) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыЗакрытыеДляИзмененияСрезПоследних.ЗакрытДляРедактирования КАК ЗакрытДляРедактирования
		|ИЗ
		|	РегистрСведений.ДокументыЗакрытыеДляИзменения.СрезПоследних КАК ДокументыЗакрытыеДляИзмененияСрезПоследних
		|ГДЕ
		|	ДокументыЗакрытыеДляИзмененияСрезПоследних.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда

		Возврат ВыборкаДетальныеЗаписи.ЗакрытДляРедактирования;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции	
//--- БАО 08.06.2017 №1024 

//+++ БАО 27.06.2017 №1180

Функция СформироватьНомераПалетПоМаркеТранспортаИПоВремениОкончанияРейсаПлюсПрефикс(Док) Экспорт 
	
	Запрос = Новый Запрос;
	//+++ БАО 25.09.2017 №1180
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	РейсПоездки.ПланируемоеВремяОкончанияПоездки КАК ВремяПрибытия,
	//               |	РейсПоездки.Ссылка.Ссылка КАК Рейс,
	//               |	ВЫБОР
	//               |		КОГДА РейсПоездки.Ссылка.Транспорт.Наименование ПОДОБНО ""WW%""
	//               |			ТОГДА 1
	//               |		КОГДА РейсПоездки.Ссылка.Транспорт.Наименование ПОДОБНО ""Ларгус%""
	//               |			ТОГДА 2
	//               |		КОГДА РейсПоездки.Ссылка.Транспорт.Наименование ПОДОБНО ""Наемник%""
	//               |				ИЛИ РейсПоездки.Ссылка.Транспорт.Наименование ПОДОБНО ""Наёмник%""
	//               |			ТОГДА 3
	//               |		ИНАЧЕ 4
	//               |	КОНЕЦ КАК Префикс
	//               |ИЗ
	//               |	Документ.Рейс.Поездки КАК РейсПоездки
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗагрузкаРейсовВероут.Рейсы КАК ЗагрузкаРейсовВероутРейсы
	//               |		ПО РейсПоездки.Ссылка.Ссылка = ЗагрузкаРейсовВероутРейсы.Рейс.Ссылка
	//               |ГДЕ
	//               |	ЗагрузкаРейсовВероутРейсы.Ссылка.Ссылка = &Док
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	Префикс,
	//               |	РейсПоездки.ПланируемоеВремяОкончанияПоездки УБЫВ";
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РейсПоездки.ПланируемоеВремяОкончанияПоездки КАК ВремяПрибытия,
	               |	РейсПоездки.Ссылка.Ссылка КАК Рейс,
	               |	РейсПоездки.Ссылка.Транспорт КАК Транспорт
	               |ПОМЕСТИТЬ ВТ_Рейсы
	               |ИЗ
	               |	Документ.Рейс.Поездки КАК РейсПоездки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗагрузкаРейсовВероут.Рейсы КАК ЗагрузкаРейсовВероутРейсы
	               |		ПО РейсПоездки.Ссылка.Ссылка = ЗагрузкаРейсовВероутРейсы.Рейс.Ссылка
	               |ГДЕ
	               |	ЗагрузкаРейсовВероутРейсы.Ссылка.Ссылка = &Док
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Рейсы.Транспорт КАК Транспорт,
	               |	МАКСИМУМ(ВсеРейсыПоТранспорту.Ссылка) КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ПоследниеРейсы
	               |ИЗ
	               |	ВТ_Рейсы КАК ВТ_Рейсы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс КАК ВсеРейсыПоТранспорту
	               |		ПО ВТ_Рейсы.Транспорт = ВсеРейсыПоТранспорту.Транспорт
	               |ГДЕ
	               |	ВсеРейсыПоТранспорту.ДатаРейса <= &НачалоПрошлогоДня
	               |	И ВсеРейсыПоТранспорту.ПометкаУдаления = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Рейсы.Транспорт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Рейсы.Рейс КАК Рейс,
	               |	МАКСИМУМ(ПривязкаМашинКРейсамСрезПоследних.Транспорт) КАК Транспорт
	               |ПОМЕСТИТЬ ВТ_Рейс_ТранспортПрошлогоДня
	               |ИЗ
	               |	ВТ_Рейсы КАК ВТ_Рейсы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследниеРейсы КАК ВТ_ПоследниеРейсы
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(, ) КАК ПривязкаМашинКРейсамСрезПоследних
	               |			ПО ВТ_ПоследниеРейсы.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс
	               |		ПО ВТ_Рейсы.Транспорт = ВТ_ПоследниеРейсы.Транспорт
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Рейсы.Рейс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Рейсы.ВремяПрибытия КАК ВремяПрибытия,
	               |	ВТ_Рейсы.Рейс КАК Рейс,
	               |	ВЫБОР
	               |		КОГДА ВТ_Рейс_ТранспортПрошлогоДня.Транспорт ЕСТЬ NULL
	               |			ТОГДА 600
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ЕСТЬNULL(ВТ_Рейс_ТранспортПрошлогоДня.Транспорт.Родитель.Префикс, 0) = 0
	               |					ТОГДА 600
	               |				ИНАЧЕ ВТ_Рейс_ТранспортПрошлогоДня.Транспорт.Родитель.Префикс
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Префикс,
	               |	ВЫБОР
	               |		КОГДА ВТ_Рейс_ТранспортПрошлогоДня.Транспорт ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК НетПривязки,
	               |	ВТ_Рейс_ТранспортПрошлогоДня.Транспорт КАК Транспорт,
	               |	ВТ_Рейс_ТранспортПрошлогоДня.Транспорт.Родитель.Префикс КАК ПрефиксГруппы,
	               |	ВТ_Рейсы.Транспорт КАК ТранспортВероут
	               |ИЗ
	               |	ВТ_Рейсы КАК ВТ_Рейсы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Рейс_ТранспортПрошлогоДня КАК ВТ_Рейс_ТранспортПрошлогоДня
	               |		ПО ВТ_Рейсы.Рейс = ВТ_Рейс_ТранспортПрошлогоДня.Рейс
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Префикс,
	               |	ВремяПрибытия УБЫВ";



	
	//--- БАО 25.09.2017 №1180
	Запрос.УстановитьПараметр("Док", Док);
	Запрос.УстановитьПараметр("КонецПрошлогоДня", НачалоДня(ТекущаяДата())-1);
	Запрос.УстановитьПараметр("НачалоПрошлогоДня", НачалоДня(НачалоДня(ТекущаяДата())-1));
	
	

	Рез = Запрос.Выполнить().Выгрузить(); 
	
	ТекущийПрефикс = 0;
	НП = 1;
	
	//Для Тестов
	//Док = Документы.ЗагрузкаРейсовВероут.НайтиПоНомеру("000000910");
	//ПолучитьФорма("Обработка.ВыгрузкаМашинВВероут.Форма.ФормаУправляемая").СформироватьНомераПалетт(Док);
	
	
	Для Каждого Тек Из Рез Цикл
		Рейс = Тек.Рейс.ПолучитьОбъект();
		Рейс.НомерПалетты = НП;

			
		Если  ТекущийПрефикс <> Тек.Префикс Тогда
				НП = 1;
				ТекущийПрефикс = Тек.Префикс;
			КонецЕсли;	
			
			НПСтрока = Формат(НП,"ЧГ=0");  
			//Если Тек.НетПривязки Тогда
			//	НПСтрока =  НПСтрока + "600";	
			//Иначе
				НПСтрока = (Тек.Префикс) + НПСтрока;
			//КонецЕсли;	
			Рейс.НомерПалетты = Число(НПСтрока);
			
		Попытка
			
			Рейс.Записать(РежимЗаписиДокумента.Запись);
			
		Исключение

		КонецПопытки;
		
		НП = НП + 1;
		
	КонецЦикла;	
	
	Возврат Рез;
	
КонецФункции	

Функция СформироватьНомераПалетт(Загрузка) Экспорт
	
	Док = Загрузка.ПолучитьОбъект();
	
	Зап = Новый Запрос;
	Если Загрузка.РежимНазначенияНомеровПалет = Перечисления.РежимыНазначенияНомеровПалет.Случайно Или не значениезаполнено(Загрузка.РежимНазначенияНомеровПалет) Тогда
		Зап.Текст = "ВЫБРАТЬ
		|	ЗагрузкаРейсовВероутРейсы.Рейс.Ссылка КАК Рейс
		|ИЗ
		|	Документ.ЗагрузкаРейсовВероут.Рейсы КАК ЗагрузкаРейсовВероутРейсы
		|ГДЕ
		|	ЗагрузкаРейсовВероутРейсы.Ссылка.Ссылка = &Док
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗагрузкаРейсовВероутРейсы.Рейс.Транспорт.Наименование";
	ИначеЕсли Загрузка.РежимНазначенияНомеровПалет = Перечисления.РежимыНазначенияНомеровПалет.ПоВремениОкончанияРейса Тогда
		Зап.Текст = "ВЫБРАТЬ
		|	РейсПоездки.ПланируемоеВремяОкончанияПоездки КАК ВремяПрибытия,
		|	РейсПоездки.Ссылка.Ссылка КАК Рейс
		|ИЗ
		|	Документ.Рейс.Поездки КАК РейсПоездки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗагрузкаРейсовВероут.Рейсы КАК ЗагрузкаРейсовВероутРейсы
		|		ПО РейсПоездки.Ссылка.Ссылка = ЗагрузкаРейсовВероутРейсы.Рейс.Ссылка
		|ГДЕ
		|	ЗагрузкаРейсовВероутРейсы.Ссылка.Ссылка = &Док
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПланируемоеВремяОкончанияПоездки УБЫВ";
	ИначеЕсли Загрузка.РежимНазначенияНомеровПалет = Перечисления.РежимыНазначенияНомеровПалет.ПоМаркеТранспортаИПоВремениОкончанияРейса Тогда
		Зап.Текст = "ВЫБРАТЬ
		|	РейсПоездки.ПланируемоеВремяОкончанияПоездки КАК ВремяПрибытия,
		|	РейсПоездки.Ссылка.Ссылка КАК Рейс,
		|	ВЫБОР
		|		КОГДА РейсПоездки.Ссылка.Транспорт.Наименование ПОДОБНО ""Ларгус%""
		|			ТОГДА 3
		|		КОГДА РейсПоездки.Ссылка.Транспорт.Наименование ПОДОБНО ""WW%""
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК Приоритет
		|ИЗ
		|	Документ.Рейс.Поездки КАК РейсПоездки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗагрузкаРейсовВероут.Рейсы КАК ЗагрузкаРейсовВероутРейсы
		|		ПО РейсПоездки.Ссылка.Ссылка = ЗагрузкаРейсовВероутРейсы.Рейс.Ссылка
		|ГДЕ
		|	ЗагрузкаРейсовВероутРейсы.Ссылка.Ссылка = &Док
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет,
		|	РейсПоездки.ПланируемоеВремяОкончанияПоездки УБЫВ";
		
		//+++ БАО 27.06.2017 №1180
		
	ИначеЕсли Загрузка.РежимНазначенияНомеровПалет = Перечисления.РежимыНазначенияНомеровПалет.ПоМаркеТранспортаИПоВремениОкончанияРейсаПлюсПрефикс Тогда
		
	КонецеСли;	
	
	ТекущийПрефикс = 0;
	
	Если Загрузка.РежимНазначенияНомеровПалет = Перечисления.РежимыНазначенияНомеровПалет.ПоМаркеТранспортаИПоВремениОкончанияРейсаПлюсПрефикс Тогда
		
		Рез = baoВызовСервера.СформироватьНомераПалетПоМаркеТранспортаИПоВремениОкончанияРейсаПлюсПрефикс(Загрузка.Ссылка)
		
	Иначе
		
		Зап.УстановитьПараметр("Док", Загрузка.Ссылка);			
		
		Рез = Зап.Выполнить().Выгрузить(); 
		
		НП = 1; 
		
		Для Каждого Тек Из Рез Цикл
			
			Рейс = Тек.Рейс.ПолучитьОбъект();
			Рейс.НомерПалетты = НП;
			
			
			Попытка
				
				Рейс.Записать(РежимЗаписиДокумента.Запись);
				
			Исключение
				
			КонецПопытки;
			
			НП = НП + 1;
			
		КонецЦикла;	
		
	КонецЕсли;

	
	Док.ФормироватьНомераПалетт = Истина;
	Док.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат Рез;
	
КонецФункции	

//--- БАО 27.06.2017 №1180

Функция ПолучитьУдаленноеЗакрытиеДляТранспортаПоРейсу(Рейс) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПривязкаМашинКРейсамСрезПоследних.Рейс КАК Рейс,
		|	ПривязкаМашинКРейсамСрезПоследних.Транспорт КАК Транспорт
		|ПОМЕСТИТЬ ВТ_ПривязкаМашинКРейсам
		|ИЗ
		|	РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(, Рейс = &Рейс) КАК ПривязкаМашинКРейсамСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеПараметрыТранспортаСрезПоследних.УдаленноеЗакрытиеРейсов КАК УдаленноеЗакрытиеРейсов
		|ИЗ
		|	РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних(
		|			,
		|			Транспорт В
		|				(ВЫБРАТЬ
		|					ВТ_ПривязкаМашинКРейсам.Транспорт КАК Транспорт
		|				ИЗ
		|					ВТ_ПривязкаМашинКРейсам КАК ВТ_ПривязкаМашинКРейсам)) КАК ДополнительныеПараметрыТранспортаСрезПоследних";
	
	Запрос.УстановитьПараметр("Рейс", Рейс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда

		Возврат ВыборкаДетальныеЗаписи.УдаленноеЗакрытиеРейсов;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
